title: Remove Immutable File Attribute - Auditd
id: a5b977d6-8a81-4475-91b9-49dbfcd941f7
status: test
description: Detects removing immutable file attribute.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md
author: Jakob Weinzettl, oscd.community
date: 2019/09/23
modified: 2022/11/26
tags:
    - attack.defense_evasion
    - attack.t1222.002
logsource:
    product: linux
    service: auditd
detection:
    selection1:
        auditd.data.syscall: execve
    selection2:
        process.args|endswith: chattr
    selection3:
        process.args: '-i'
    condition: selection1 and selection2 and selection3 
falsepositives:
    - Administrator interacting with immutable files (e.g. for instance backups).
level: medium
