title: Password Policy Discovery
id: ca94a6db-8106-4737-9ed2-3e3bb826af0a
status: stable
description: Detects password policy discovery commands
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1201/T1201.md
    - https://linux.die.net/man/1/chage
    - https://man7.org/linux/man-pages/man1/passwd.1.html
    - https://superuser.com/questions/150675/how-to-display-password-policy-information-for-a-user-ubuntu
author: Ömer Günal, oscd.community, Pawel Mazur
date: 2020/10/08
modified: 2022/12/18
tags:
    - attack.discovery
    - attack.t1201
logsource:
    product: linux
    service: auditd
detection:
    selection_files:
        tags: 'password_discovery'
    exec:
        auditd.data.syscall: execve
    a1:
        process.args: 'chage'
    a2:
        process.args:
            - '--list'
            - '-l'
    b1:
        process.args: 'passwd'
    b2:
        process.args:
            - '-S'
            - '--status'
    condition: selection_files or ((exec and a1 and a2) or (exec and b1 and b2))
falsepositives:
    - Legitimate administration activities
level: low
