title: Data Compressed
id: a3b5e3e9-1b49-4119-8b8e-0344a01f21ee
status: test
description: An adversary may compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
author: Timur Zinniatullin, oscd.community
date: 2019/10/21
modified: 2021/11/27
tags:
    - attack.exfiltration
    - attack.t1560.001
logsource:
    product: linux
    service: auditd
detection:
    cmd:
        auditd.data.syscall: execve
    zip:
        process.args: 'zip'
    gzip1:
        process.args|endswith: 'gzip'
    gzip2:
        process.args: '-f'
    tar1:
        process.args: 'tar'
    tar2:
        process.args|contains: '-c'
    condition: cmd and (zip or (gzip1 and gzip2) or (tar1 and tar2))
falsepositives:
    - Legitimate use of archiving tools by legitimate user.
level: low
