title: Clipboard Collection with Xclip Tool - Auditd
id: 214e7e6c-f21b-47ff-bb6f-551b2d143fcf
status: test
description: |
  Detects attempts to collect data stored in the clipboard from users with the usage of xclip tool.
  Xclip has to be installed.
  Highly recommended using rule on servers, due to high usage of clipboard utilities on user workstations.
references:
    - https://linux.die.net/man/1/xclip
    - https://www.cyberciti.biz/faq/xclip-linux-insert-files-command-output-intoclipboard/
author: 'Pawel Mazur'
date: 2021/09/24
modified: 2022/11/26
tags:
    - attack.collection
    - attack.t1115
logsource:
    product: linux
    service: auditd
detection:
    selection1:
        auditd.data.syscall: execve
    selection2:
        process.args|endswith: xclip
    selection3:
        process.args:
          - '-selection'
          - '-sel'
    selection4:
        process.args:
          - clipboard
          - clip
    selection5: 
          - process.args: '-o'
    condition: selection1 and selection2 and selection3 and selection4 and selection5
falsepositives:
    - Legitimate usage of xclip tools
level: low
