title: Clipboard Collection of Image Data with Xclip Tool
id: f200dc3f-b219-425d-a17e-c38467364816
status: test
description: |
  Detects attempts to collect image data stored in the clipboard from users with the usage of xclip tool.
  Xclip has to be installed.
  Highly recommended using rule on servers, due to high usage of clipboard utilities on user workstations.
references:
    - https://linux.die.net/man/1/xclip
author: 'Pawel Mazur'
date: 2021/10/01
modified: 2022/10/09
tags:
    - attack.collection
    - attack.t1115
logsource:
    product: linux
    service: auditd
detection:
    selection1:
        auditd.data.syscall: execve
    selection2:
        process.args|endswith: xclip
    selection3:
        process.args:
          - '-selection'
          - '-sel'
    selection4:
        process.args:
          - clipboard
          - clip
    selection5: 
          - process.args: '-t'
    selection6: 
          - process.args|startswith: 'image/'
    selection7:
          - process.args: '-o'
    condition: selection1 and selection2 and selection3 and selection4 and selection5 and selection6 and selection7
falsepositives:
    - Legitimate usage of xclip tools
level: low
