title: Audio Capture
id: a7af2487-9c2f-42e4-9bb9-ff961f0561d5
status: test
description: Detects attempts to record audio with arecord utility
references:
    - https://linux.die.net/man/1/arecord
    - https://linuxconfig.org/how-to-test-microphone-with-audio-linux-sound-architecture-alsa
author: 'Pawel Mazur'
date: 2021/09/04
modified: 2022/10/09
tags:
    - attack.collection
    - attack.t1123
logsource:
    product: linux
    service: auditd
detection:
    selection1:
        auditd.data.syscall: execve
    selection2:
        process.args|endswith: arecord
    selection3:
        process.args: '-vv'
    selection4:
        process.args: '-f'
    selection5:
        process.args: 'dat'
    condition: selection1 AND selection2 AND selection3 AND selection4 AND selection5
falsepositives:
    - Unknown
level: low
