title: Network Sniffing - Linux
id: f4d3748a-65d1-4806-bd23-e25728081d01
status: test
description: |
  Network sniffing refers to using the network interface on a system to monitor or capture information sent over a wired or wireless connection.
  An adversary may place a network interface into promiscuous mode to passively access data in transit over the network, or use span ports to capture a larger amount of data.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md
author: Timur Zinniatullin, oscd.community
date: 2019/10/21
modified: 2022/12/18
tags:
    - attack.credential_access
    - attack.discovery
    - attack.t1040
logsource:
    product: linux
    service: auditd
detection:
    exec:
      auditd.data.syscall: execve
    a1:
      process.args: 'tcpdump'
    a2:
      process.args: '-c'
    a3:
      process.args|contains: '-i'
    b1:
      process.args: 'tshark'
    b2:
      process.args: '-c'
    b3:
      process.args: '-i'
    condition: exec and ((a1 and a2 and a3) or (b1 and b2 and b3))
falsepositives:
    - Legitimate administrator or user uses network sniffing tool for legitimate reasons.
level: low
